**复习：**在前面我们已经学习了Pandas基础，第二章我们开始进入数据分析的业务部分，在第二章第一节的内容中，我们学习了**数据的清洗**，这一部分十分重要，只有数据变得相对干净，我们之后对数据的分析才可以更有力。而这一节，我们要做的是数据重构，数据重构依旧属于数据理解（准备）的范围。

#### 开始之前，导入numpy、pandas包和数据

In [1]:
# 导入基本库
import numpy as np
import pandas as pd

In [4]:
# 载入上一个任务人保存的文件中:result.csv，并查看这个文件
df = pd.read_csv('data/result.csv')
df.head()

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# 2 第二章：数据重构

## 第一部分：数据聚合与运算

### 2.6 数据运用

#### 2.6.1 任务一：通过教材《Python for Data Analysis》P303、Google or anything来学习了解GroupBy机制

#写入心得
groupby()用于数据分组以及分组之后的组内计算，最基本的就是组内计数, 求和, 求均值, 求方差

#### 2.4.2：任务二：计算泰坦尼克号男性与女性的平均票价

In [5]:
# 写入代码
list(df.groupby(df['Sex']))

[('female',
       Unnamed: 0  PassengerId  Survived  Pclass  \
  1             1            2         1       1
  2             2            3         1       3
  3             3            4         1       1
  8             8            9         1       3
  9             9           10         1       2
  ..          ...          ...       ...     ...
  880         441          881         1       2
  882         443          883         0       3
  885         446          886         0       3
  887         448          888         1       1
  888         449          889         0       3

                                                    Name     Sex   Age  SibSp  \
  1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
  2                               Heikkinen, Miss. Laina  female  26.0      0
  3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
  8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0      0
  9                  Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1
  ..                                                 ...     ...   ...    ...
  880       Shelley, Mrs. William (Imanita Parrish Hall)  female  25.0      0
  882                       Dahlberg, Miss. Gerda Ulrika  female  22.0      0
  885               Rice, Mrs. William (Margaret Norton)  female  39.0      0
  887                       Graham, Miss. Margaret Edith  female  19.0      0
  888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1

       Parch            Ticket     Fare Cabin Embarked
  1        0          PC 17599  71.2833   C85        C
  2        0  STON/O2. 3101282   7.9250   NaN        S
  3        0            113803  53.1000  C123        S
  8        2            347742  11.1333   NaN        S
  9        0            237736  30.0708   NaN        C
  ..     ...               ...      ...   ...      ...
  880      1            230433  26.0000   NaN        S
  882      0              7552  10.5167   NaN        S
  885      5            382652  29.1250   NaN        Q
  887      0            112053  30.0000   B42        S
  888      2        W./C. 6607  23.4500   NaN        S

  [314 rows x 13 columns]),
 ('male',
       Unnamed: 0  PassengerId  Survived  Pclass  \
  0             0            1         0       3
  4             4            5         0       3
  5             5            6         0       3
  6             6            7         0       1
  7             7            8         0       3
  ..          ...          ...       ...     ...
  883         444          884         0       2
  884         445          885         0       3
  886         447          887         0       2
  889         450          890         1       1
  890         451          891         0       3

                                 Name   Sex   Age  SibSp  Parch  \
  0           Braund, Mr. Owen Harris  male  22.0      1      0
  4          Allen, Mr. William Henry  male  35.0      0      0
  5                  Moran, Mr. James  male   NaN      0      0
  6           McCarthy, Mr. Timothy J  male  54.0      0      0
  7    Palsson, Master. Gosta Leonard  male   2.0      3      1
  ..                              ...   ...   ...    ...    ...
  883   Banfield, Mr. Frederick James  male  28.0      0      0
  884          Sutehall, Mr. Henry Jr  male  25.0      0      0
  886           Montvila, Rev. Juozas  male  27.0      0      0
  889           Behr, Mr. Karl Howell  male  26.0      0      0
  890             Dooley, Mr. Patrick  male  32.0      0      0

                 Ticket     Fare Cabin Embarked
  0           A/5 21171   7.2500   NaN        S
  4              373450   8.0500   NaN        S
  5              330877   8.4583   NaN        Q
  6               17463  51.8625   E46        S
  7              349909  21.0750   NaN        S
  ..                ...      ...   ...      ...
  883  C.A./SOTON 34068  10.5000   NaN        S
  884   SOTON/OQ 392076   7.0500   NaN        S
  886            211536  13.0000   NaN        S
  889            111369  30.0000  C148        C
  890            370376   7.7500   NaN        Q

  [577 rows x 13 columns])]

In [6]:
group = df.groupby('Sex')
group.describe()

       Unnamed: 0                                                            \
            count        mean         std  min    25%    50%     75%    max
Sex
female      314.0  227.305732  132.683758  1.0  109.5  236.0  340.75  449.0
male        577.0  219.571924  126.605257  0.0  112.0  219.0  330.00  451.0

       PassengerId              ... Parch        Fare                        \
             count        mean  ...   75%  max  count       mean        std
Sex                             ...
female       314.0  431.028662  ...   1.0  6.0  314.0  44.479818  57.997698
male         577.0  454.147314  ...   0.0  5.0  577.0  25.523893  43.138263


         min        25%   50%    75%       max
Sex
female  6.75  12.071875  23.0  55.00  512.3292
male    0.00   7.895800  10.5  26.55  512.3292

[2 rows x 64 columns]

In [19]:
group = df.groupby('Sex')['Fare']
print(group.describe())
print(group.mean())
sex_mean = group.mean()

        count       mean        std   min        25%   50%    75%       max
Sex
female  314.0  44.479818  57.997698  6.75  12.071875  23.0  55.00  512.3292
male    577.0  25.523893  43.138263  0.00   7.895800  10.5  26.55  512.3292
Sex
female    44.479818
male      25.523893
Name: Fare, dtype: float64

在了解GroupBy机制之后，运用这个机制完成一系列的操作，来达到我们的目的。

下面通过几个任务来熟悉GroupBy机制。

#### 2.4.3：任务三：统计泰坦尼克号中男女的存活人数

In [24]:
# 写入代码
survived_sex = df.groupby('Sex')['Survived'].sum()
survived_sex.head()

Sex
female    233
male      109
Name: Survived, dtype: int64

#### 2.4.4：任务四：计算客舱不同等级的存活人数

In [23]:
# 写入代码
survived_Pclass = df.groupby('Pclass')['Survived'].sum()
survived_Pclass.head()

Pclass
1    136
2     87
3    119
Name: Survived, dtype: int64

【**提示：**】表中的存活那一栏，可以发现如果还活着记为1，死亡记为0

【**思考**】从数据分析的角度，上面的统计结果可以得出那些结论

#思考心得 
女性的平均票价大于男性平均票价，且女性存活人数更多，一等舱存活人数更多

【思考】从任务二到任务三中，这些运算可以通过agg()函数来同时计算。并且可以使用rename函数修改列名。你可以按照提示写出这个过程吗？

In [16]:
#思考心得

df.groupby('Sex').agg({'Fare': 'mean', 'Pclass': 'count'}).rename(
    columns= {'Fare': 'mean_fare', 'Pclass': 'count_pclass'})

        mean_fare  count_pclass
Sex
female  44.479818           314
male    25.523893           577

#### 2.4.5：任务五：统计在不同等级的票中的不同年龄的船票花费的平均值

In [17]:
# 写入代码
df.groupby(['Pclass','Age'])['Fare'].mean().head()

Pclass  Age
1       0.92     151.5500
        2.00     151.5500
        4.00      81.8583
        11.00    120.0000
        14.00    120.0000
Name: Fare, dtype: float64

#### 2.4.6：任务六：将任务二和任务三的数据合并，并保存到sex_fare_survived.csv

In [22]:
sex_mean.index
survived_sex.index

Int64Index([1, 2, 3], dtype='int64', name='Pclass')

In [25]:
# 写入代码
result = pd.merge(sex_mean,survived_sex,on='Sex')
result

             Fare  Survived
Sex
female  44.479818       233
male    25.523893       109

#### 2.4.7：任务七：得出不同年龄的总的存活人数，然后找出存活人数最多的年龄段，最后计算存活人数最高的存活率（存活人数/总人数）

In [26]:

#不同年龄的存活人数
survived_age = df.groupby('Age')['Survived'].sum()
survived_age.head()

Age
0.42    1
0.67    1
0.75    2
0.83    2
0.92    1
Name: Survived, dtype: int64

In [27]:
#找出最大值的年龄段
survived_age[survived_age.values==survived_age.max()]

Age
24.0    15
Name: Survived, dtype: int64

In [30]:
# 存活人数最高的存活率

Survived_sum = df['Survived'].sum()
Survived_sum

342

In [32]:
precetn =survived_age.max()/Survived_sum
precetn

0.043859649122807015

In [2]:
# 写入代码